In [1]:
import numpy as np
import pandas as pd
import sklearn
import spacy
import nltk
from nltk.corpus import stopwords
from nltk.stem import PorterStemmer

The **Combined_Jobs_Final.csv** file: has the main jobs data(**title, description, company, etc.**)

The **Job_Views.csv** file: the file with the jobs seeing for the user.

The **Experience.csv**: the file containing the experience from the user.

The **Positions_Of_Interest.csv**: contains the interest the user previously has manifested.

---
## Job Views data

In [2]:
jViews = pd.read_csv('Job_Views.csv')
print(jViews.shape)
jViews.head()

(12370, 14)

,Applicant.ID,Job.ID,Title,Position,Company,City,State.Name,State.Code,Industry,View.Start,View.End,View.Duration,Created.At,Updated.At
0,10000,73666,Cashiers & Valets Needed! @ WallyPark,Cashiers & Valets Needed!,WallyPark,Newark,New Jersey,NJ,NaN,2014-12-12 20:12:35 UTC,2014-12-12 20:31:24 UTC,1129.0,2014-12-12 20:12:35 UTC,2014-12-12 20:12:35 UTC
1,10000,96655,Macy's Seasonal Retail Fragrance Cashier - Ga...,Macy's Seasonal Retail Fragrance Cashier - Ga...,Macy's,Garden City,New York,NY,NaN,2014-12-12 20:08:50 UTC,2014-12-12 20:10:15 UTC,84.0,2014-12-12 20:08:50 UTC,2014-12-12 20:08:50 UTC
2,10001,84141,Part Time Showroom Sales / Cashier @ Grizzly I...,Part Time Showroom Sales / Cashier,Grizzly Industrial Inc.,Bellingham,Washington,WA,NaN,2014-12-12 20:12:32 UTC,2014-12-12 20:17:18 UTC,286.0,2014-12-12 20:12:32 UTC,2014-12-12 20:12:32 UTC
3,10002,77989,Event Specialist Part Time @ Advantage Sales &...,Event Specialist Part Time,Advantage Sales & Marketing,Simpsonville,South Carolina,SC,NaN,2014-12-12 20:39:23 UTC,2014-12-12 20:42:13 UTC,170.0,2014-12-12 20:39:23 UTC,2014-12-12 20:39:23 UTC
4,10002,69568,Bonefish - Kitchen Staff @ Bonefish Grill,Bonefish - Kitchen Staff,Bonefish Grill,Greenville,South Carolina,SC,NaN,2014-12-12 20:43:25 UTC,2014-12-12 20:43:58 UTC,33.0,2014-12-12 20:43:25 UTC,2014-12-12 20:43:25 UTC

In [3]:
jViews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12370 entries, 0 to 12369
Data columns (total 14 columns):
Applicant.ID     12370 non-null int64
Job.ID           12370 non-null int64
Title            12370 non-null object
Position         12370 non-null object
Company          11790 non-null object
City             12370 non-null object
State.Name       12348 non-null object
State.Code       12348 non-null object
Industry         2199 non-null object
View.Start       12370 non-null object
View.End         10575 non-null object
View.Duration    10575 non-null float64
Created.At       12370 non-null object
Updated.At       12370 non-null object
dtypes: float64(1), int64(2), object(11)
memory usage: 1.3+ MB

In [4]:
list(jViews)

['Applicant.ID',
 'Job.ID',
 'Title',
 'Position',
 'Company',
 'City',
 'State.Name',
 'State.Code',
 'Industry',
 'View.Start',
 'View.End',
 'View.Duration',
 'Created.At',
 'Updated.At']

In [5]:
jViews = jViews.drop(['Job.ID', 'Title', 'State.Name', 'State.Code', 'Industry', 'View.Start', 'View.End', 'View.Duration', 'Created.At', 'Updated.At'], axis=1)
jViews.head()

,Applicant.ID,Position,Company,City
0,10000,Cashiers & Valets Needed!,WallyPark,Newark
1,10000,Macy's Seasonal Retail Fragrance Cashier - Ga...,Macy's,Garden City
2,10001,Part Time Showroom Sales / Cashier,Grizzly Industrial Inc.,Bellingham
3,10002,Event Specialist Part Time,Advantage Sales & Marketing,Simpsonville
4,10002,Bonefish - Kitchen Staff,Bonefish Grill,Greenville

In [6]:
jViews.isna().sum()

Applicant.ID      0
Position          0
Company         580
City              0
dtype: int64

In [7]:
jViews['jViewCorpus'] = jViews['Position'].map(str) +' '+jViews["Company"] +"  "+ jViews["City"]
jViews = jViews.drop(['Position', 'Company', 'City'], axis=1)
jViews.columns = ['ApplicantID', 'jViewCorpus']
jViews.head()

   ApplicantID                                        jViewCorpus
0        10000        Cashiers & Valets Needed! WallyPark  Newark
1        10000  Macy's Seasonal Retail Fragrance Cashier  - Ga...
2        10001  Part Time Showroom Sales / Cashier Grizzly Ind...
3        10002  Event Specialist Part Time Advantage Sales & M...
4        10002  Bonefish - Kitchen Staff Bonefish Grill  Green...

In [8]:
jViews.jViewCorpus = jViews.jViewCorpus.str.lower()
jViews.jViewCorpus = jViews.jViewCorpus.str.replace('[^a-z \n\.]', ' ')
jViews.head()

   ApplicantID                                        jViewCorpus
0        10000        cashiers   valets needed  wallypark  newark
1        10000  macy s seasonal retail fragrance cashier    ga...
2        10001  part time showroom sales   cashier grizzly ind...
3        10002  event specialist part time advantage sales   m...
4        10002  bonefish   kitchen staff bonefish grill  green...

In [9]:
jViews.to_csv('jView_df.csv')

---
## Experience data

In [10]:
experience = pd.read_csv('experience.csv')
experience.head()

,Applicant.ID,Position.Name,Employer.Name,City,State.Name,State.Code,Start.Date,End.Date,Job.Description,Salary,Can.Contact.Employer,Created.At,Updated.At
0,10001,Account Manager / Sales Administration / Quali...,Barcode Resourcing,Bellingham,Washington,WA,2012-10-15,NaN,NaN,NaN,NaN,2014-12-12 20:10:02 UTC,2014-12-12 20:10:02 UTC
1,10001,Electronics Technician / Item Master Controller,Ryzex Group,Bellingham,Washington,WA,2001-12-01,2012-04-01,NaN,NaN,NaN,2014-12-12 20:10:02 UTC,2014-12-12 20:10:02 UTC
2,10001,Machine Operator,comptec inc,Custer,Washington,WA,1997-01-01,1999-01-01,NaN,NaN,NaN,2014-12-12 20:10:02 UTC,2014-12-12 20:10:02 UTC
3,10003,maintenance technician,Winn residental,washington,District of Columbia,DC,NaN,NaN,"Necessary maintenance for ""Make Ready"" Plumbin...",10.0,False,2014-12-12 21:27:05 UTC,2014-12-12 21:27:05 UTC
4,10003,Electrical Helper,michael and son services,alexandria,Virginia,VA,NaN,NaN,repair and services of electrical construction,NaN,False,2014-12-12 21:27:05 UTC,2014-12-12 21:27:05 UTC

In [11]:
experience.isna().sum()

Applicant.ID               0
Position.Name            950
Employer.Name             33
City                    3731
State.Name              4058
State.Code              4058
Start.Date              2035
End.Date                3747
Job.Description         2961
Salary                  5855
Can.Contact.Employer    5072
Created.At                 0
Updated.At                 0
dtype: int64

In [12]:
list(experience)

['Applicant.ID',
 'Position.Name',
 'Employer.Name',
 'City',
 'State.Name',
 'State.Code',
 'Start.Date',
 'End.Date',
 'Job.Description',
 'Salary',
 'Can.Contact.Employer',
 'Created.At',
 'Updated.At']

In [13]:
experience = experience.drop(['Employer.Name', 'City', 'State.Name', 'State.Code', 'Start.Date', 'End.Date', 'Job.Description', 'Salary', 'Can.Contact.Employer', 'Created.At', 'Updated.At'], axis=1)
experience.columns = ['ApplicantID', 'Position']
experience.head()

   ApplicantID                                           Position
0        10001  Account Manager / Sales Administration / Quali...
1        10001    Electronics Technician / Item Master Controller
2        10001                                   Machine Operator
3        10003                             maintenance technician
4        10003                                 Electrical Helper

In [14]:
experience.Position = experience.Position.str.lower()
experience.Position = experience.Position.str.replace('[^a-z \n\.]', ' ').fillna(' ')
experience = experience.sort_values(by='ApplicantID')
experience.head(15)

      ApplicantID                                           Position
2763            2                                          volunteer
2762            2                          writer for the uloop blog
3759            3                                   marketing intern
3758            3                                             server
3757            3                                          prep cook
6277            6                                  project assistant
7490            8  deli clerk server  cashier  food prep  order t...
368            11                                            cashier
809            12                                             server
810            12                                       rec leader
811            12                       it program management intern
1177           13                                   offica assistant
1178           13                                            cashier
1176           13                                          assistant
1672           14                                           waitress

As we see, there are sometimes more than one application for the applicant. Those will be marged to one.

In [15]:
experience = experience.groupby('ApplicantID', sort=False)['Position'].apply(' '.join).reset_index()
experience.head(20)

    ApplicantID                                           Position
0             2                volunteer writer for the uloop blog
1             3                  marketing intern server prep cook
2             6                                  project assistant
3             8  deli clerk server  cashier  food prep  order t...
4            11                                            cashier
5            12   server rec leader   it program management intern
6            13                 offica assistant cashier assistant
7            14                            waitress host lifeguard
8            15
9            18                barista cashier server receptionist
10           21                                            cashier
11           22      sandwich artist shift leader personal in home
12           23            waiter server film editor waiter server
13           24                                          volunteer
14           26                                            cashier
15           27  farm intern event organizer lifeguard and chil...
16           30                           server barback expediter
17           32                    roundup newspaper intern intern
18           33      waitress hostess softlines team trainer nanny
19           34                                 server server host

In [16]:
experience.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3790 entries, 0 to 3789
Data columns (total 2 columns):
ApplicantID    3790 non-null int64
Position       3790 non-null object
dtypes: int64(1), object(1)
memory usage: 59.3+ KB

In [17]:
experience.to_csv('experience_df.csv')

---
## Position of Interest

In [18]:
poi = pd.read_csv('Positions_Of_Interest.csv')
poi = poi.sort_values(by='Applicant.ID')
poi.head()

,Applicant.ID,Position.Of.Interest,Created.At,Updated.At
6437,96,Server,2014-08-14 15:56:42 UTC,2015-02-26 20:35:12 UTC
1156,153,Barista,2014-08-14 15:56:43 UTC,2015-02-18 02:35:06 UTC
1155,153,Host,2014-08-14 15:56:42 UTC,2015-02-26 20:35:12 UTC
1154,153,Server,2014-08-14 15:56:42 UTC,2015-02-26 20:35:12 UTC
1158,153,Sales Rep,2014-08-14 15:56:47 UTC,2015-03-02 02:13:08 UTC

In [19]:
poi = poi.drop(['Created.At', 'Updated.At'], axis=1)
poi.columns = ['ApplicantID', 'POI']
poi.POI = poi.POI.str.lower()
poi.POI = poi.POI.str.replace('[^a-z \n\.]', ' ').fillna(' ')
poi.head(10)

      ApplicantID                   POI
6437           96                server
1156          153               barista
1155          153                  host
1154          153                server
1158          153             sales rep
1157          153  customer service rep
1952          256                  host
1957          256       production area
1956          256             sales rep
1955          256  customer service rep

As we see, there are sometimes more than one position of intrest. Those will be marged to one.

In [20]:
poi = poi.groupby('ApplicantID', sort=True)['POI'].apply(' '.join).reset_index()
poi.head(10)

   ApplicantID                                                POI
0           96                                             server
1          153  barista host server sales rep customer service...
2          256  host production area sales rep customer servic...
3          438           customer service rep barista host server
4          568      receptionist customer service rep book keeper
5          601              customer service rep server line cook
6          867       driver customer service rep book keeper chef
7          938      host receptionist customer service rep server
8         1210  line cook host training community relations cu...
9         1251                  fine arts retail part time travel

In [21]:
poi.to_csv('poi_df.csv')

---
# Marge DataFrames

In [22]:
user_df = jViews.merge(experience, how='outer', left_on='ApplicantID', right_on='ApplicantID').fillna(' ')
user_df = user_df.sort_values(by='ApplicantID')
user_df.head()

,ApplicantID,jViewCorpus,Position
12370,2,,volunteer writer for the uloop blog
12371,3,,marketing intern server prep cook
12372,6,,project assistant
12373,8,,deli clerk server cashier food prep order t...
12374,11,,cashier

In [23]:
user_df = user_df.merge(poi, how='outer', left_on='ApplicantID', right_on='ApplicantID').fillna('')
user_df = user_df.sort_values(by='ApplicantID')
user_df.head(10)

,ApplicantID,jViewCorpus,Position,POI
0,2,,volunteer writer for the uloop blog,
1,3,,marketing intern server prep cook,
2,6,,project assistant,
3,8,,deli clerk server cashier food prep order t...,
4,11,,cashier,
5,12,,server rec leader it program management intern,
6,13,,offica assistant cashier assistant,
7,14,,waitress host lifeguard,
8,15,,,
9,18,,barista cashier server receptionist,

In [24]:
user_df['Corpus'] = user_df.jViewCorpus.map(str)+' '+user_df.Position+' '+user_df.POI
user_df = user_df.drop(['jViewCorpus', 'Position', 'POI'], axis=1)
user_df.Corpus = user_df.Corpus.fillna(' ')
user_df.columns = ['ApplicantID', 'Corpus']

user_df.head()

   ApplicantID                                             Corpus
0            2               volunteer writer for the uloop blog
1            3                 marketing intern server prep cook
2            6                                 project assistant
3            8    deli clerk server  cashier  food prep  order...
4           11                                           cashier

In [25]:
# drop all the rows with a empty corpus. (This is an expensive operation. Would be good to optimize this block)
user_df = user_df.drop(user_df[user_df.Corpus == ' '].index, axis=0)
user_df = user_df.sort_values(by='ApplicantID')
user_df.head()

   ApplicantID                                             Corpus
0            2               volunteer writer for the uloop blog
1            3                 marketing intern server prep cook
2            6                                 project assistant
3            8    deli clerk server  cashier  food prep  order...
4           11                                           cashier

In [26]:
user_df.to_csv('user_df.csv', index=False)